def a():
    countries_dict = {"Австрия": "Вена", "Бельгия": "Брюссель", "Великобритания": "Лондон", "Германия": "Берлин", "Ирландия": "Дублин", "Лихтенштейн": "Вадуц", "Нидерладны": "Амстердам",
                    "Франция": "Париж", "Белоруссия": "Минск", "Болгария": "София", "Польша": "Варшава", "Чехия": "Прага", "Албания": "Тирана", "Босния и Герцеговина": "Сараево",
                    "Северная Македония": "Скопье", "Сербия": "Белград"}
    print(countries_dict)
    cap=str(input("enter the name of the country"))
    print(countries_dict[str(cap)])
    for i in sorted(countries_dict):
        print(i, "-", countries_dict[i])


def b():
    alph = {
        "а": 1,
        "б": 3,
        "в": 1,
        "г": 3,
        "д": 2,
        "е": 1,
        "ё": 3,
        "ж": 5,
        "з": 5,
        "и": 1,
        "й": 4,
        "к": 2,
        "л": 2,
        "м": 2,
        "н": 1,
        "о": 1,
        "п": 2,
        "р": 1,
        "с": 1,
        "т": 1,
        "у": 2,
        "ф": 10,
        "х": 5,
        "ц": 5,
        "ч": 5,
        "ш": 8,
        "щ": 10,
        "ъ": 10,
        "ы": 4,
        "ь": 3,
        "э": 8,
        "ю": 8,
        "я": 3
    }
    word=input("enter your word")
    summa=0
    for i in word:
        summa += alph[i.lower()]
    print (summa)


def c():
    stud= { 'Вдовичева':['Русский','Китайский','Французский'],'Дубчак':['Французский','Английский'],'Яриз':['Китайский','Английский'],'Трушкова':['Немецкий','Китайский','Английский'],'Соболева':['Русский','Китайский','Английский','Французский'],'Азарян':['Французский','Русский'],'Логинов':['Английский','Китайский','Русский'],'Банбасов':['Русский','Английский'],'Старостина':['Французский','Китайский','Немецкий'],'Денисов':['Немецкий','Русский'],'Афанасьев':['Французский','Немецкий','Русский']}
    languages= set()
    chinese=[]
    i=0
    for stud1, language in stud.items():
        languages.update(language)
        if 'Китайский' in language:
            chinese.append(stud1)
            i+=1
    languagesnew=sorted(list(languages))
    chinesenew=sorted(list(chinese))
    print('Список языков:', languagesnew)
    print('Студенты, знающие китайский язык:', chinesenew)
    print('Количество:', i)
c()